In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'name': ['Michael', 'Dwight', 'Pam', 'Jim', 'Angela'],
    'number': [4, 5, 7, 8, np.nan]
}

In [3]:
df = pd.DataFrame(data)

df

      name  number
0  Michael     4.0
1   Dwight     5.0
2      Pam     7.0
3      Jim     8.0
4   Angela     NaN

In [4]:
df.dropna()

      name  number
0  Michael     4.0
1   Dwight     5.0
2      Pam     7.0
3      Jim     8.0